In [1]:
import numpy as np
import pandas as pd

In [59]:
files = 'C:/Users/yiran/Google Drive/2018 S1/Cleaning Data/Material Data/ABS OCCUP FINAL.xlsx'
sheet = pd.ExcelFile(files)
ABS_Final = sheet.parse('Sheet1')

In [60]:
files = 'C:/Users/yiran/Google Drive/2018 S1/Cleaning Data/Material Data/ABS/2016 2014 2012 all full-time.xlsx'
sheet = pd.ExcelFile(files)
ABS_2016 = sheet.parse('2016')

In [61]:
merged_2016 = pd.merge(ABS_Final, ABS_2016, how = 'inner')

In [62]:
merged_2016.head(5)

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
0,CHIEF EXECUTIVES AND MANAGING DIRECTORS,2675.5,2618.0,2665.2
1,GENERAL MANAGERS,2871.1,2309.5,2713.9
2,LEGISLATORS,NaN,0.0,NaN
3,CROP FARMERS,NaN,0.0,NaN
4,LIVESTOCK FARMERS,NaN,0.0,NaN

In [63]:
len(merged_2016)

350

In [64]:
len(ABS_Final)

349

In [65]:
len(ABS_2016)

354

In [66]:
ABS_2016[~ABS_2016.OCCUPATIONS.isin(merged_2016.OCCUPATIONS)]

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
179,SHEARERS,NaN,0.0,NaN
189,CANVAS AND LEATHER GOODS MAKERS,NaN,NaN,NaN
333,AQUACULTURE WORKERS,NaN,0.0,NaN
353,ALL OCCUPATIONS,1457.0,1010.2,1230.7

In [67]:
ABS_Final[~ABS_Final.OCCUPATIONS.isin(merged_2016.OCCUPATIONS)]

Empty DataFrame
Columns: [OCCUPATIONS]
Index: []

### Merge 2014

In [68]:
files = 'C:/Users/yiran/Google Drive/2018 S1/Cleaning Data/Material Data/ABS/2016 2014 2012 all full-time.xlsx'
sheet = pd.ExcelFile(files)
ABS_2014 = sheet.parse('2014')

In [69]:
merged_2014 = pd.merge(ABS_Final, ABS_2014, how = 'inner')

In [70]:
merged_2014.head(5)

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
0,CHIEF EXECUTIVES AND MANAGING DIRECTORS,2755.1,2808.6,2765.0
1,GENERAL MANAGERS,2819.7,1963.9,2573.6
2,LEGISLATORS,NaN,0.0,NaN
3,CROP FARMERS,1613.9,0.0,1613.9
4,LIVESTOCK FARMERS,NaN,NaN,1711.7

In [71]:
len(merged_2014)

349

In [72]:
len(ABS_Final)

349

In [73]:
len(ABS_2014)

356

In [74]:
ABS_2014[~ABS_2014.OCCUPATIONS.isin(merged_2014.OCCUPATIONS)]

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
23,SENIOR NON-COMMISSIONED DEFENCE FORCE MEMBERS,NaN,0.0,NaN
163,FLOOR FINISHERS,689.0,0.0,689.0
180,SHEARERS,NaN,0.0,NaN
197,JEWELLERS,NaN,0.0,NaN
220,DEFENCE FORCE MEMBERS - OTHER RANKS,NaN,NaN,NaN
335,AQUACULTURE WORKERS,NaN,0.0,NaN
355,ALL OCCUPATIONS,1429.8,940.2,1182.4

In [75]:
ABS_Final[~ABS_Final.OCCUPATIONS.isin(merged_2014.OCCUPATIONS)]

Empty DataFrame
Columns: [OCCUPATIONS]
Index: []

### Merge 2012

In [76]:
files = 'C:/Users/yiran/Google Drive/2018 S1/Cleaning Data/Material Data/ABS/2016 2014 2012 all full-time.xlsx'
sheet = pd.ExcelFile(files)
ABS_2012 = sheet.parse('2012')

In [77]:
merged_2012 = pd.merge(ABS_Final, ABS_2012, how = 'inner')

In [78]:
merged_2012.head(5)

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
0,CHIEF EXECUTIVES AND MANAGING DIRECTORS,2697.7,2019.1,2553.4
1,GENERAL MANAGERS,2583.1,1567.4,2384.1
2,LEGISLATORS,NaN,0.0,NaN
3,CROP FARMERS,1171.0,0.0,1171.0
4,LIVESTOCK FARMERS,NaN,NaN,1015.0

In [79]:
len(merged_2012)

349

In [80]:
len(ABS_Final)

349

In [81]:
len(ABS_2012)

353

In [82]:
ABS_2012[~ABS_2012.OCCUPATIONS.isin(merged_2012.OCCUPATIONS)]

,OCCUPATIONS,MALES CASH EARNINGS,FEMALES CASH EARNINGS,PERSONS CASH EARNINGS
162,FLOOR FINISHERS,426.4,0.0,426.4
188,CANVAS AND LEATHER GOODS MAKERS,NaN,NaN,NaN
196,JEWELLERS,NaN,0.0,NaN
352,ALL OCCUPATIONS,1342.5,904.0,1122.6

In [83]:
ABS_Final[~ABS_Final.OCCUPATIONS.isin(merged_2012.OCCUPATIONS)]

Empty DataFrame
Columns: [OCCUPATIONS]
Index: []

### Concat three

In [91]:
dfcombining = [merged_2016, merged_2014, merged_2012]

In [92]:
dfcombined = pd.concat(dfcombining)

In [93]:
len(dfcombined)

1048

In [96]:
len(merged_2016)

350

In [98]:
len(merged_2014)

349

In [97]:
len(merged_2012)

349

In [94]:
len(merged_2016)+len(merged_2014)+len(merged_2012)

1048

In [99]:
writer = pd.ExcelWriter('C:/Users/yiran/Google Drive/2018 S1/Cleaning Data/Material Data/ABS FINAL.xlsx')
dfcombined.to_excel(writer,sheet_name = 'Sheet1', index = True)
writer.save()